[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
-                        required: "Dining Hall name is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Dining Hall name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
