[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:79:30
                                 pattern: teamid_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && 'TeamId is required.'}
+                            {false}
                             {errors.teamId?.type === 'pattern' && 'TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /TeamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:79:30
                                 pattern: teamid_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && 'TeamId is required.'}
+                            {errors.teamId || 'TeamId is required.'}
                             {errors.teamId?.type === 'pattern' && 'TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests renders correctly when passing in a RequesterEmail
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

<label
  class="form-label"
  for="id"
>

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:80:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'TeamId is required.'}
-                            {errors.teamId?.type === 'pattern' && 'TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3'}
+                            {true && 'TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3'}
                         </Form.Control.Feedback>
                         
killedBy: HelpRequestForm tests renders correctly when passing in a RequesterEmail
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

<label
  class="form-label"
  for="id"
>

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:80:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'TeamId is required.'}
-                            {errors.teamId?.type === 'pattern' && 'TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3'}
+                            {true}
                         </Form.Control.Feedback>
                         
killedBy: HelpRequestForm tests Correct Error messsages on bad input: teamId
statusReason: Error: Unable to find an element with the text: /TeamId must be in the format qYY-nTT-S, e.g. s22-5pm-3/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:110:69
                             id="requestTime"
                             type="requestTime-local"
                             isInvalid={Boolean(errors.requestTime)}
-                            {...register("requestTime", { required: true, pattern: isodate_regex })}
+                            {...register("requestTime", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /RequestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:110:57
                             id="requestTime"
                             type="requestTime-local"
                             isInvalid={Boolean(errors.requestTime)}
-                            {...register("requestTime", { required: true, pattern: isodate_regex })}
+                            {...register("requestTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /RequestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:113:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'RequestTime is required.'}
+                            {errors.requestTime || 'RequestTime is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input: teamId
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:113:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'RequestTime is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /RequestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:142:42
                             id="solved"
                             type="text"
                             isInvalid={Boolean(errors.solved)}
-                            {...register("solved", { 
+                            {...register("", { 
                                 required: true,
                                 pattern: /^(true|false)$/
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:143:43
                             type="text"
                             isInvalid={Boolean(errors.solved)}
                             {...register("solved", { 
-                                required: true,
+                                required: false,
                                 pattern: /^(true|false)$/
                             })}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:148:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.solved && 'Solved is required.'}
+                            {false}
                             {errors.solved?.type === 'pattern' && 'Solved must be true or false, e.g. true'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:148:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.solved && 'Solved is required.'}
+                            {true}
                             {errors.solved?.type === 'pattern' && 'Solved must be true or false, e.g. true'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:149:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be true or false, e.g. true'}
+                            {errors.solved?.type === 'pattern' || 'Solved must be true or false, e.g. true'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Solved must be true or false, e.g. true</div> instead

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:149:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be true or false, e.g. true'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input: solved
statusReason: Error: Unable to find an element with the text: /Solved must be true or false, e.g. true/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
