[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:94:57
                             id="explanation"
                             type="text"
                             isInvalid={Boolean(errors.title)}
-                            {...register("explanation", {
-                                required: "Explanation is required."
-                            })}
+                            {...register("explanation", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:111:42
                             id="email"
                             type="text"
                             isInvalid={Boolean(errors.title)}
-                            {...register("email", {
+                            {...register("", {
                                 required: "Email is required."
                             })}
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:130:67
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("dateAdded", { required: true, pattern: isodate_regex })}
+                            {...register("dateAdded", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateAdded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:130:55
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("dateAdded", { required: true, pattern: isodate_regex })}
+                            {...register("dateAdded", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateAdded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
